print('ร้านขายสังฆทาน')
print('เพิ่มข้อมูล กด [a]')
print('แสดงข้อมูล กด [b]')
print('ออกจากระบบ กด [x]')
while(True):
    x=(input(':'))
    if x=='a':
        data=input('ป้อนรายการลูกค้า(รหัส :,ชื่อ :,จังหวัด :)')
        print('****ข้อมูลเข้าสู่ระบบแล้ว****')
    elif(x=='b'):
        print('แสดงข้อมูล รหัส,ชื่อ,จังหวัด :',data,'ตามลำดับ')
    elif(x=='x'):
        q=input('ต้องการปิดโปรแกรมใช่หรือไม่ Y/N' )
    elif q=='Y':
        break
        print('จบการทำงาน')
    elif q=='N'
            
