s=[0,0,0,0,0]
ch = 0
def menu():
    global ch
    print('\tโปรแกรมร้านค้าออนไลน์\n 1.แสดงรายการสินค้า\n 2.หยิบสินค้าเข้าตะกร้า\n 3.แสดงจำนวนและราคาของสินค้าที่หยิบ\n 4.ปิดโปรแกรม')
    ch = input('กรุณาเลือกรายการ :')
def listall():
    print('\tรายการสินค้า\n 1.ยาดม ราคา 15 บาท\n 2.น้ำเปล่า ราคา 10 บาท\n 3.มาม่า ราคา 20 บาท\n 4.สบู่ ราคา 30 บาท\n 5.แปรงสีฟัน ราคา 25 บาท')

def pickshop():
    print('\n 1.ยาดม \n 2.น้ำเปล่า \n 3.มาม่า \n 4.สบู่ \n 5.แปรงสีฟัน\n 6.ออกจากฟังก์ชัน')
    while True:
        x=int(input('เลือกหยิบสินค้าหมายเลข'))
        if x==1:
            s[0]+=1 
        elif x==2:
            s[1]+=1
        elif x==3:
            s[2]+=1
        elif x==4:
            s[3]+=1
        elif x==5:
            s[4]+=1
        elif x == 6:
            break
def showpick():
    print('_'*5+'สินค้าที่คุณได้หยิบไปมีดังนี้'+'_'*5)
    print('สินค้า'+' '*5+'จำนวน'+' '*5+'ราคา')
    print('-'*28)
    print('ยาดม'+' '*5,s[0],' '*6,s[0]*15)
    print('น้ำเปล่า'+' '*3,s[1],' '*6,s[1]*10)
    print('มาม่า'+' '*5,s[2],' '*6,s[2]*20)
    print('สบู่'+' '*7,s[3],' '*6,s[3]*30)
    print('แปรงสีฟัน'+' '*2,s[4],' '*6,s[4]*25)
while True:
    menu()
    if ch =='1':
        listall()
    elif ch =='2':
        pickshop()
    elif ch == '3':
        showpick()
    elif ch=='4':
        f=input('ต้องการออกจากโปรแกรมใช่หรือไม่ y/n: ')
        if f=='y' :
            break
        elif f=='n':
            continue
