print('โปรแกรมคำนวนค่าผ่านทางมอเตอร์เวย์')
print('รถยนต์ 4 ล้อ         กด1')
print('รถยนต์ 6 ล้อ         กด2')
print('รถยนต์มากว่า 6 ล้อ    กด3')
carlist=['_','ค่าบริการรถยนต์ 4 ล้อ','ค่าบริการรถยนต์ 6 ล้อ','ค่าบริการรถยนต์มากกว่า 6 ล้อ']
thisdict={
    1 : 'ลาดกระบัง-->บางบ่อ 25 บาท\nลาดกระบัง-->บางประกง 30 บาท\nลาดกระบัง-->พนัสนิคม 45 บาท\nลาดกระบัง-->บ้านบึง 55 บาท\nลาดกระบัง-->บ้านพระ 60 บาท',
    2 : 'ลาดกระบัง-->บางบ่อ 45 บาท\nลาดกระบัง-->บางประกง 45 บาท\nลาดกระบัง-->พนัสนิคม 75 บาท\nลาดกระบัง-->บ้านบึง 90 บาท\nลาดกระบัง-->บ้านพระ 100 บาท',
    3 : 'ลาดกระบัง-->บางบ่อ 60 บาท\nลาดกระบัง-->บางประกง 70 บาท\nลาดกระบัง-->พนัสนิคม 110 บาท\nลาดกระบัง-->บ้านบึง 130 บาท\nลาดกระบัง-->บ้านพระ 140 บาท'
}
x = int(input('เลือกประเภทยานพาหนะ : '))
print(carlist[x])
print(thisdict[x])